
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 21 to change, 2 to destroy.</code></pre>

* Update
  * azapi_resource.add_local_user
  * azurerm_application_insights.appinsights
  * azurerm_key_vault_secret.app_insights_key
  * azurerm_key_vault_secret.evidence_share_topic_primary_shared_access_key
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * azurerm_monitor_action_group.scs-dead-letter-action-group[&#34;sscs-aat-dead-letter&#34;]
  * azurerm_monitor_metric_alert.alerts[&#34;sscs-aat-dead-letter-alerts&#34;]
  * azurerm_resource_group.rg
  * module.metric-alert.azurerm_resource_group_template_deployment.metric-alert
  * module.metric-alert-slack.azurerm_resource_group_template_deployment.metric-alert
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.sftp_storage.azurerm_private_endpoint.this[0]
  * module.sftp_storage.azurerm_storage_account.storage_account
  * module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.sscs-vault.azurerm_key_vault.kv
  * module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sscs-vault.azurerm_user_assigned_identity.managed_identity[0]
* Replace
  * module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.notifications-subscription.azurerm_servicebus_subscription.servicebus_subscription


<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.add_local_user will be updated in-place
  ~ resource "azapi_resource" "add_local_user" {
      ~ body                      = (sensitive)
        id                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat/localUsers/sscsaat"
        name                      = (sensitive)
      ~ output                    = jsonencode({}) -> (known after apply)
        tags                      = {}
        # (7 unchanged attributes hidden)
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/components/sscs-aat"
        name                                  = "sscs-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_key" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/e65b1e170acd42edb518fa00d6f7684d"
        name                    = "AppInsightsInstrumentationKey"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (8 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.evidence_share_topic_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "evidence_share_topic_primary_shared_access_key" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/evidence-share-topic-shared-access-key/d616443081f441ec9dd1cf2615bb23db"
        name                    = "evidence-share-topic-shared-access-key"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (8 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/sscs-servicebus-connection-string-tf/0e2b5b317df544789b9662d7d5d56b3d"
        name                    = "sscs-servicebus-connection-string-tf"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (8 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id                      = "https://sscs-aat.vault.azure.net/secrets/sscs-servicebus-shared-access-key/cfaa031bb4924506b86e40d841e7d4e7"
        name                    = "sscs-servicebus-shared-access-key"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (8 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_monitor_action_group.scs-dead-letter-action-group["sscs-aat-dead-letter"] will be updated in-place
  ~ resource "azurerm_monitor_action_group" "scs-dead-letter-action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/actionGroups/sscs-aat-dead-letter"
        name                = "sscs-aat-dead-letter"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_monitor_metric_alert.alerts["sscs-aat-dead-letter-alerts"] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "alerts" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Insights/metricAlerts/sscs-aat-dead-letter-alerts"
        name                = "sscs-aat-dead-letter-alerts"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat"
        name     = "sscs-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.evidenceshare-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this"  {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT1H" -> (known after apply)
      ~ enable_batched_operations               = false -> (known after apply)
      ~ enable_express                          = false -> (known after apply)
      ~ enable_partitioning                     = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply)
      ~ max_size_in_megabytes                   = 2048 -> (known after apply)
        name                                    = "sscs-evidenceshare-topic-aat"
      ~ requires_duplicate_detection            = true -> (known after apply)
      ~ status                                  = "Active" -> (known after apply)
      ~ support_ordering                        = false -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.evidenceshare-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat/subscriptions/sscs-evidenceshare-subscription-aat" -> (known after apply)
        name                                      = "sscs-evidenceshare-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.metric-alert.data.template_file.actiongrouptemplate will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "actiongrouptemplate"  {
      ~ id       = "c7e687abf716c9dca824eff9febcbdd116370257067e078dac02135366c2a7e2" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "string"
                    }
                  - alertDescription          = {
                      - type = "string"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "string"
                    }
                  - alertQuery                = {
                      - type = "string"
                    }
                  - alertSeverity             = {
                      - type = "string"
                    }
                  - alertWindowSize           = {
                      - type = "string"
                    }
                  - commonTags                = {
                      - type = "string"
                    }
                  - location                  = {
                      - type = "string"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "string"
                    }
                  - storageAccountsExternalId = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.metric-alert.azurerm_resource_group_template_deployment.metric-alert will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-email"
        name                = "sscs-fail-alert-sscssftp-email"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags                = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJzb2NpYWwtc2VydmljZS1jaGlsZC1zdXBwb3J0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0=" -> "eyJhcHBsaWNhdGlvbiI6InNvY2lhbC1zZXJ2aWNlLWNoaWxkLXN1cHBvcnQiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0="
                }
                # (9 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "String"
                    }
                  - alertDescription          = {
                      - type = "String"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "String"
                    }
                  - alertQuery                = {
                      - type = "String"
                    }
                  - alertSeverity             = {
                      - type = "String"
                    }
                  - alertWindowSize           = {
                      - type = "String"
                    }
                  - commonTags                = {
                      - type = "String"
                    }
                  - location                  = {
                      - type = "String"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "String"
                    }
                  - storageAccountsExternalId = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.metric-alert-slack.data.template_file.actiongrouptemplate will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "actiongrouptemplate"  {
      ~ id       = "c7e687abf716c9dca824eff9febcbdd116370257067e078dac02135366c2a7e2" -> (known after apply)
      ~ rendered = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "string"
                    }
                  - alertDescription          = {
                      - type = "string"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "string"
                    }
                  - alertQuery                = {
                      - type = "string"
                    }
                  - alertSeverity             = {
                      - type = "string"
                    }
                  - alertWindowSize           = {
                      - type = "string"
                    }
                  - commonTags                = {
                      - type = "string"
                    }
                  - location                  = {
                      - type = "string"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "string"
                    }
                  - storageAccountsExternalId = {
                      - type = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.metric-alert-slack.azurerm_resource_group_template_deployment.metric-alert will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-slack"
        name                = "sscs-fail-alert-sscssftp-slack"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags                = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJzb2NpYWwtc2VydmljZS1jaGlsZC1zdXBwb3J0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0=" -> "eyJhcHBsaWNhdGlvbiI6InNvY2lhbC1zZXJ2aWNlLWNoaWxkLXN1cHBvcnQiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0="
                }
                # (9 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
            {
              - $schema        = "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - actionGroupsExternalId    = {
                      - type = "String"
                    }
                  - alertDescription          = {
                      - type = "String"
                    }
                  - alertEvaluationFrequency  = {
                      - type = "String"
                    }
                  - alertQuery                = {
                      - type = "String"
                    }
                  - alertSeverity             = {
                      - type = "String"
                    }
                  - alertWindowSize           = {
                      - type = "String"
                    }
                  - commonTags                = {
                      - type = "String"
                    }
                  - location                  = {
                      - type = "String"
                    }
                  - scheduledQueryRulesName   = {
                      - type = "String"
                    }
                  - storageAccountsExternalId = {
                      - type = "String"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2022-06-15"
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('scheduledQueryRulesName')]"
                      - properties = {
                          - actions                = {
                              - actionGroups     = [
                                  - "[parameters('actionGroupsExternalId')]",
                                ]
                              - actionProperties = {}
                              - customProperties = {}
                            }
                          - autoMitigate           = false
                          - criteria               = {
                              - allOf = [
                                  - {
                                      - dimensions      = []
                                      - failingPeriods  = {
                                          - minFailingPeriodsToAlert  = 1
                                          - numberOfEvaluationPeriods = 1
                                        }
                                      - operator        = "GreaterThan"
                                      - query           = "[parameters('alertQuery')]"
                                      - threshold       = 0
                                      - timeAggregation = "Count"
                                    },
                                ]
                            }
                          - description            = "[parameters('alertDescription')]"
                          - displayName            = "[parameters('scheduledQueryRulesName')]"
                          - enabled                = true
                          - evaluationFrequency    = "[parameters('alertEvaluationFrequency')]"
                          - overrideQueryTimeRange = "P2D"
                          - scopes                 = [
                              - "[parameters('storageAccountsExternalId')]",
                            ]
                          - severity               = "[parameters('alertSeverity')]"
                          - targetResourceTypes    = [
                              - "Microsoft.Storage/storageAccounts",
                            ]
                          - windowSize             = "[parameters('alertWindowSize')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "microsoft.insights/scheduledqueryrules"
                    },
                ]
              - variables      = {
                  - tags = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.notifications-subscription.data.azurerm_servicebus_topic.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_topic" "this"  {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT1H" -> (known after apply)
      ~ enable_batched_operations               = false -> (known after apply)
      ~ enable_express                          = false -> (known after apply)
      ~ enable_partitioning                     = false -> (known after apply)
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply)
      ~ max_size_in_megabytes                   = 2048 -> (known after apply)
        name                                    = "sscs-evidenceshare-topic-aat"
      ~ requires_duplicate_detection            = true -> (known after apply)
      ~ status                                  = "Active" -> (known after apply)
      ~ support_ordering                        = false -> (known after apply)
        # (2 unchanged attributes hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.notifications-subscription.azurerm_servicebus_subscription.servicebus_subscription must be replaced
-/+ resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      ~ id                                        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat/subscriptions/sscs-notifications-subscription-aat" -> (known after apply)
        name                                      = "sscs-notifications-subscription-aat"
      ~ topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat/topics/sscs-evidenceshare-topic-aat" -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
        id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.ServiceBus/namespaces/sscs-servicebus-aat"
        name                                = "sscs-servicebus-aat"
      ~ tags                                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # module.sftp_storage.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/privateEndpoints/sscssftpaat"
        name                     = "sscssftpaat"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sftp_storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat"
        name                              = "sscssftpaat"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              - "82.9.48.2",
            ]
            # (3 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.sscs-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_alert"
        name                     = "SSCSF_alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.sscs-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/SSCSF_slack"
        name                = "SSCSF_slack"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.sscs-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert"
        name                = "sscs-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJzb2NpYWwtc2VydmljZS1jaGlsZC1zdXBwb3J0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0=" -> "eyJhcHBsaWNhdGlvbiI6InNvY2lhbC1zZXJ2aWNlLWNoaWxkLXN1cHBvcnQiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0="
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.sscs-sya-submit-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-sya-submit-fail"
        name                = "sscs-sya-submit-fail"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYXBwbGljYXRpb24iOiJzb2NpYWwtc2VydmljZS1jaGlsZC1zdXBwb3J0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY2hhbmdlVXJsIjoiIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0=" -> "eyJhcHBsaWNhdGlvbiI6InNvY2lhbC1zZXJ2aWNlLWNoaWxkLXN1cHBvcnQiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvc3Njcy1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNzc2NzLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJTU0NTIn0="
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.sscs-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat"
        name                            = "sscs-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat|sscs-aat"
        name                       = "sscs-aat"
        # (2 unchanged attributes hidden)



      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

  # module.sscs-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sscs-aat-mi"
        name                = "sscs-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (7 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 21 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.metric-alert-slack.azurerm_resource_group_template_deployment.metric-alert has changed
  ~ resource "azurerm_resource_group_template_deployment" "metric-alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Resources/deployments/sscs-fail-alert-sscssftp-slack"
        name                = "sscs-fail-alert-sscssftp-slack"
      + tags                = {}
        # (5 unchanged attributes hidden)
    }

  # module.sftp_storage.azurerm_storage_account.storage_account has changed
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.Storage/storageAccounts/sscssftpaat"
        name                              = "sscssftpaat"
        tags                              = {
            "BuiltFrom"           = "https://github.com/HMCTS/sscs-shared-infrastructure.git"
            "application"         = "social-service-child-support"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#sscs-tech"
            "environment"         = "staging"
            "managedBy"           = "SSCS"
        }
        # (37 unchanged attributes hidden)


      ~ network_rules {
          ~ ip_rules                   = [
              + "82.9.48.2",
            ]
            # (3 unchanged attributes hidden)

          + private_link_access {
              + endpoint_resource_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/providers/Microsoft.Security/datascanners/storageDataScanner"
              + endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            }
        }


        # (3 unchanged blocks hidden)
    }

  # module.sscs-vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sscs-aat/providers/Microsoft.KeyVault/vaults/sscs-aat|sscs-aat"
        name                       = "sscs-aat"
        # (2 unchanged attributes hidden)



      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":158,"Program":"tfcmt","SHA1":"","Vars":{}} -->